---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MacroFailures.DuplicateModuleName
source: html/35406cc4-a516-ae07-23b8-02bc3ff51691.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MacroFailures.DuplicateModuleName Property

Macro project with name [MacroModuleName] duplicates with central file. Delete the macro project or re-create it with another name to proceed.

## Syntax (C#)
```csharp
public static FailureDefinitionId DuplicateModuleName { get; }
```